using Tyuiu.NedelkinFA.Sprint1.Task2.V29.Lib;
DataService ds = new DataService();

Console.Title = "Спринт #1 | Выполнил: Неделькин Ф. А. | ИИПБ-24-1";
Console.WriteLine("************************************************************************************************");
Console.WriteLine("* Спринт #1                                                                                    *");
Console.WriteLine("* Тема: Базовые навыки работы в C#                                                             *");
Console.WriteLine("* Задание #2                                                                                   *");
Console.WriteLine("* Вариант #29                                                                                  *");
Console.WriteLine("* Выполнил: Неделькин Ф. А. | ИИПБ-24-1                                                        *");
Console.WriteLine("************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                     *");
Console.WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные,                      *");
Console.WriteLine("* выполняет указанные расчёты и печатает результат на экране.                                  *");
Console.WriteLine("*                                                                                              *");
Console.WriteLine("************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                             *");
Console.WriteLine("************************************************************************************************");

int x;

Console.WriteLine("Введите значение X:");
x = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("************************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                   *");
Console.WriteLine("************************************************************************************************");

Console.WriteLine("Число в секундах в часах будет: "+ ds.ConvertSecondsToHours(x));

Console.ReadKey();