using Tyuiu.NedelkinFA.Sprint1.Task3.V4.Lib;

DataService ds = new DataService();

Console.Title = "Спринт #1 | Выполнил: Неделькин Ф. А. | ИИПБ-24-1";
Console.WriteLine("************************************************************************************************");
Console.WriteLine("* Спринт #1                                                                                    *");
Console.WriteLine("* Тема: Базовые навыки работы в C#                                                             *");
Console.WriteLine("* Задание #1                                                                                   *");
Console.WriteLine("* Вариант #22                                                                                  *");
Console.WriteLine("* Выполнил: Неделькин Ф. А. | ИИПБ-24-1                                                        *");
Console.WriteLine("************************************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                                     *");
Console.WriteLine("* Написать программу, которая запрашивает у пользователя исходные данные,                      *");
Console.WriteLine("* вычисляет результат по формуле (5+x)/(y*x) и выводит его на экран.                           *");
Console.WriteLine("*                                                                                              *");
Console.WriteLine("************************************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                             *");
Console.WriteLine("************************************************************************************************");

double x = 2.75;
double y = 0.5;
int wait = 7;

Console.WriteLine("************************************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                   *");
Console.WriteLine("************************************************************************************************");

Console.WriteLine("Стоимость покупки:" + ds.PurchaseAmount(x, y, wait));

Console.ReadKey();

